In [1]:
#Reading in and writing out to files - Pandos IO documentation

In [52]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('C:\\Users\\billy\\Desktop\\Python Finance\\03-Core-Pandas\\tips.csv')

In [6]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [8]:
pwd

'C:\\Users\\billy\\Desktop\\Jupyter Notebooks\\Pandas'

In [10]:
df.to_csv('C:\\Users\\billy\\Desktop\\Jupyter Notebooks\\Pandas\\new_file.csv')

In [16]:
#Excel - Treats excel workbook as a dictionary
#Can require additional libraries to run - openpyxl/ xlrd

In [22]:
df = pd.read_excel('C:\\Users\\billy\\Desktop\\Python Finance\\03-Core-Pandas\\my_excel_file.xlsx', sheet_name='First_Sheet')

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
#What to do if I don't know sheet names - Will read in everything and setup a dictionary

In [32]:
excel_sheet_dict = pd.read_excel('C:\\Users\\billy\\Desktop\\Python Finance\\03-Core-Pandas\\my_excel_file.xlsx', sheet_name=None)

In [33]:
type(excel_sheet_dict)

dict

In [34]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [35]:
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [36]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [37]:
#Sheet name is key and value is the DF

In [38]:
new_df = excel_sheet_dict['First_Sheet']

In [39]:
new_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [41]:
new_df.to_excel('example.xlsx', sheet_name='First Sheet', index=False) #Removes unnecessary index

In [46]:
#SQL -SQLite compes preinstalled with Python

In [47]:
#Establish what SQL engine is being connected - PostgeSQL, MySQL, MS SQL Server etc

In [48]:
#Install appropriate Python driver library
#PostgreSQL - psycopg2
#MySQL - pymysql
#MS SQL Server - pyodbc

In [49]:
#docs.sqlalchemy.org/en/13/dialects/index.html

In [50]:
from sqlalchemy import create_engine

In [62]:
temp_db = create_engine('sqlite:///:memory:') #Creates a temporary DB inside computer's RAM

In [73]:
pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a', 'b', 'c', 'd'])

    a   b   c   d
0  60  31  68  32
1  43  38  38  33
2  30  64  46  16
3  19  67  98  57

In [79]:
df.to_sql(name='new_table', con=temp_db, if_exists='replace', index=False) #If exists replace so I could remove index - default is fail if it already exists

In [80]:
#Read in information - Make sure DB isn't too big as it will read to RAM

In [81]:
new_sql_df = pd.read_sql(sql='new_table', con=temp_db)

In [82]:
new_sql_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [83]:
#Pass in SQL Query to Pandas

In [85]:
sql_query_example = pd.read_sql_query(sql="SELECT a, c FROM new_table", con=temp_db)

In [86]:
sql_query_example

    a   c
0   0   2
1   4   6
2   8  10
3  12  14